const postContainer = document.querySelector('.post-content')
let id = location.href.split('?')[1]
const posts = [
    {
        id:9,
        img:'9.jpg',
        title:'كود البناء السعودي',
        date:' 15.11.2023 ',
        category:'كود البناء السعودي',
        desc:`تعريف كود البناء السعودي:
        هو مجموعة الاشتراطات والمتطلبات من أنظمة ولوائح تنفذيه​​ وملاحق متعلقة بالبناء والتشييد لضمان السلامة والصحة العامة.
        
        أهمية كود البناء السعودي
        تتطلب المنشآت بكافة أنواعها بوجه عام توفر كود بناء يحدد اشتراطات الأمان والسلامة والراحة في كافة مراحل البناء، ويزداد الأمر أهمية في المملكة العربية السعودية لطبيعتها الجغرافية واختلاف أجواء مناطقها المختلفة فالمناخ الصحراوي الجاف بالداخل والرطوبة العالية في المناطق القريبة من البحر كما أنها تمتاز بشدة الحرارة في أغلب فصول السنة، وتربتها التي تحتوي على نسبه عالية من الاملاح الضارة فيها، إضافة الى وجود ظواهر زلزالية في بعض المناطق الساحلية، وكل هذه العوامل وغيرها تؤثر بوضوح على سلامة المنشآت و استدامتها وحماية المواطنين.ومن هنا جاءت أهمية وجود كود البناء للرفع من جودة البناء والحفاظ على الاقتصاد السعودي من خلال ضمان سلامة المنشآت وقاطنيها ووضع الاشتراطات التي تحدد أسس الدراسات الصحيحة والأساليب الملائمة لظروف وإمكانات المملكة مما يساعد المهندسين والفنيين والمواطنين ويمكنهم من القيام بأعمالهم بطرق سليمة ومأمونة، ويساهم في وضع حد للإختلافات بالآراء المتعددة للجهات التي تعمل في قطاع البناء والتشييد، وذلك عن طريق استخدام وتطبيق قواعد الكود كنظام معترف به على المستوى الوطني واللجوء إليه للفصل بين الخلافات لا قدر الله إن وجدت بني كافه فاعليات مستخدميه.​​​​​​`,
    },
    {
        id:1,
        img:'1.jpg',
        title:'مشروع استراحة خاصة',
        date:' 15.11.2023 ',
        category:'شاليهات',
        desc:`الهدف الرئيسي لهذا المشروع هو إنشاء استراحة خاصة للاستجمام والاسترخاء لأصحابها.
        تمثل الاستراحات الخاصة عادة مكانًا للعائلات والأصدقاء لقضاء وقت ممتع معًا دون الحاجة للسفر إلى أماكن بعيدة.
        يمكن تصميم الاستراحة بطريقة تلبي احتياجات المالك وتفضيلاته الشخصية، بما في ذلك وجود مسبح، منطقة للشواء، منطقة للألعاب، حديقة جميلة، ومرافق داخلية للراحة`,
    },
    {
        id:2,
        img:'2.jpg',
        title:'مشروع قصر الافراح',
        date:' 14.11.2023 ',
        category:'قاعة المناسبات وقصور الأفراح',
        desc:`قصر الأفراح هو منشأة مخصصة لاستضافة وإقامة المناسبات الخاصة والاحتفالات مثل حفلات الزفاف، حفلات التخرج، الاجتماعات الاجتماعية، وأي مناسبة أخرى تحتاج إلى مكان فخم ومريح.
        يتميز القصر بتصميم داخلي وخارجي فاخر يوفر أجواءً جميلة وفخمة للضيوف.
        يتضمن المشروع أماكن للجلوس والاستراحة، وصالة رئيسية لإقامة الفعاليات، ومناطق مخصصة لتقديم الطعام والمشروبات.`,
    },
    {
        id:3,
        img:'3.jpg',
        title:'مشروع كلاود سكوير',
        date:' 13.11.2023 ',
        category:'المطاعم والمطابخ',
        desc:`
        المشروع يهدف إلى إنشاء مجمع تجاري يضم عددًا من المطاعم والكافيهات المتنوعة.
        يمكن تصميم المطاعم والكافيهات بأساليب وأنماط مختلفة لتلبية احتياجات وتفضيلات مجموعة متنوعة من الزبائن.
        سيتضمن المشروع مناطق للجلوس الداخلية والخارجية لتوفير تجربة تناول الطعام متعددة الأوجه.`,
    },
    {
        id:4,
        img:'4.jpg',
        title:'مشروع استراحة خاصة',
        date:' 15.11.2023 ',
        category:'شاليهات',
        desc:`
        الاستراحة ستتضمن فيلا سكنية مصممة للراحة والاسترخاء، ويمكن تصميمها حسب رغبة المالك.
        تشمل المرافق الخارجية مساحات خضراء مع حديقة جميلة ونباتات متنوعة.
        توفير حمام سباحة للسباحة والترفيه.
        مناطق للجلوس والاستراحة في الهواء الطلق قرب المسبح أو تحت مظلات.`,
    },
    {
        id:5,
        img:'5.jpg',
        title:'فلل سكنية في حي النهضة',
        date:' 14.11.2023 ',
        category:'سكنى',
        desc:`
        المشروع يهدف إلى بناء مجموعة من الفلل السكنية عالية الجودة في حي النهضة.
        يمكن تصميم الفلل بمختلف المساحات والتصاميم لتلبية احتياجات مختلفة للعملاء.
        ستتضمن الفلل مرافق وخدمات مثل مساحات خضراء، ومواقف للسيارات، وأماكن للترفيه.`,
    },
    {
        id:6,
        img:'6.jpg',
        title:'فيلا سكنية في مدينة الشقيق',
        date:' 14.11.2023 ',
        category:'سكنى',
        desc:`
        المشروع يستهدف بناء فيلا سكنية تمنح السكان أو العائلات فرصة العيش في مكان هادئ وخاص في مدينة الشقيق.
        تصميم الفيلا يمكن أن يكون حسب الطلب، مع إمكانية تخصيص عدد الغرف والمرافق والمساحات الداخلية والخارجية.
        يتضمن المشروع بنية تحتية مثل مواقف للسيارات وحديقة وربما مسبح.`,
    },
    {
        id:7,
        img:'7.jpg',
        title:'معرض ونقطة بيع',
        date:' 14.11.2023 ',
        category:'مستودعات ومخازن وورش',
        desc:`المشروع يهدف إلى إنشاء معرض تجاري يعرض منتجات أو خدمات معينة للزبائن.
يمكن أن يكون المعرض مخصصًا للملابس والأزياء، أو الإلكترونيات، أو الأثاث، أو أي نوع آخر من المنتجات أو الخدمات.
سيتضمن المشروع نقطة بيع للزبائن للقيام بالمشتريات
        `,
    },
    {
        id:8,
        img:'8.jpg',
        title:'فيلا سكنية حي النهضة',
        date:' 14.11.2023 ',
        category:'سكنى',
        desc:`
        المشروع يستهدف بناء فيلا سكنية تمنح السكان أو العائلات فرصة العيش في مكان هادئ وخاص.
        تصميم الفيلا يمكن أن يكون حسب الطلب، مع إمكانية تخصيص عدد الغرف والمرافق والمساحات الداخلية والخارجية.
        يتضمن المشروع بنية تحتية مثل مواقف للسيارات وحديقة وربما مسبح.
        `,
    }
]

function getPost() {
    let existingPost = posts.find((post) => {
        return parseInt(id) == post.id
    })
    renderPost(existingPost)
} getPost()

function renderPost(post) {
    postContainer.innerHTML = `
    <img loading="lazy"  src="images/blog/${post.img}" class="img-responsive mb-5" alt="">
    <div class="date"> <span class="ti-tag"></span>  <p class="main-font d-inline fw-normal">${post.date}</p>  <span class="ti-time"></span><p class="d-inline">${post.category}</p></div>
    <h2>${post.title}</h2>
    <p>
        ${post.desc}</p>
    `
}